{
  "path": "/docs/core-concepts/what-are-progressive-web-apps",
  "previousText": "Web View",
  "previousUrl": "/docs/core-concepts/webview",
  "nextText": "",
  "nextUrl": "",
  "contributors": [
    "perrygovier",
    "mhartington"
  ],
  "body": [
    "div",
    null,
    "",
    " ",
    [
      "h3",
      {
        "id": "the-web-but-better"
      },
      " ",
      [
        "a",
        {
          "href": "#the-web-but-better"
        },
        "The web...but better"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "A Progressive Web App (PWA) is a web app that uses modern web capabilities to deliver an app-like experience to users.\nThese apps meet certain requirements (see below), are deployed to servers, accessible through URLs, and indexed by search engines."
    ],
    " ",
    [
      "p",
      null,
      "This can work in conjunction with ",
      [
        "a",
        {
          "href": "https://capacitor.ionicframework.com"
        },
        "Capacitor"
      ],
      " to provide a multiple deploy targets for all your users.\nYou can deploy your app as a PWA as well as Native app and take advantage of both channels."
    ],
    " ",
    [
      "p",
      null,
      "Ionic allows you to ship your app to not only the app store, but also deploy to the mobile web as a PWA."
    ],
    " ",
    [
      "h3",
      {
        "id": "what-is-required"
      },
      " ",
      [
        "a",
        {
          "href": "#what-is-required"
        },
        "What is required"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "To be considered a Progressive Web App, your app must be:"
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Progressive - Work for every user, regardless of browser choice, because they are built with progressive enhancement as a core tenet."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Responsive - Fit any form factor, desktop, mobile, tablet, or whatever is next."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Connectivity independent - Enhanced with service workers to work offline or on low quality networks."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "App-like - Use the app-shell model to provide app-style navigation and interactions."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Fresh - Always up-to-date thanks to the service worker update process."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Safe - Served via HTTPS to prevent snooping and ensure content has not been tampered with."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Discoverable - Are identifiable as “applications” thanks to W3C manifests and service worker registration scope allowing search engines to find them."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Re-engageable - Make re-engagement easy through features like push notifications."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Installable - Allow users to “keep” apps they find most useful on their home screen without the hassle of an app store."
        ],
        " "
      ],
      " ",
      [
        "li",
        null,
        [
          "p",
          null,
          "Linkable - Easily share via URL and not require complex installation."
        ],
        " "
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      [
        "em",
        null,
        [
          "a",
          {
            "href": "https://addyosmani.com/blog/getting-started-with-progressive-web-apps/",
            "target": "_blank"
          },
          "Addy Osmani: Progressive web apps"
        ]
      ]
    ],
    " ",
    [
      "p",
      null,
      "There is a lot here, but it boils down to a few points for Ionic apps."
    ],
    " ",
    [
      "h4",
      {
        "id": "offline-support"
      },
      " ",
      [
        "a",
        {
          "href": "#offline-support"
        },
        "Offline Support"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Apps should be able to work offline. Whether that be displaying a proper \"offline\" message or caching app data for display purpose."
    ],
    " ",
    [
      "h4",
      {
        "id": "web-app-manifest"
      },
      " ",
      [
        "a",
        {
          "href": "#web-app-manifest"
        }
      ],
      [
        "a",
        {
          "href": "https://developer.mozilla.org/en-US/docs/Web/Manifest",
          "target": "_blank"
        },
        "Web App Manifest"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "An app manifest file should describe the resources your app will need. This includes your app's displayed name, icons, as well as splash screen. If you link to the manifest file in your index.html, browsers will detect that and load the resources for you."
    ],
    " ",
    [
      "h4",
      {
        "id": "service-worker"
      },
      " ",
      [
        "a",
        {
          "href": "#service-worker"
        }
      ],
      [
        "a",
        {
          "href": "https://developer.mozilla.org/en-US/docs/Web/API/Service_Worker_API",
          "target": "_blank"
        },
        "Service Worker"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Service worker could be mentioned in Offline Support, but it really deserves its own section. Service worker provides a programmatic way to cache app resources. Be it JavaScript files or JSON data from a HTTP request. The programmatic API allows developers to decide how to handle caching and provides a much more flexible experience than other options."
    ]
  ],
  "title": "Progressive Web Apps",
  "headings": [],
  "pageClass": "page-core-concepts-what-are-progressive-web-apps"
}
