{
  "path": "/docs/guides/oauth/melhores-praticas",
  "body": [
    "div",
    null,
    [
      "p",
      {
        "class": "intro"
      },
      "Disponibilizamos arquivos ",
      [
        "a",
        {
          "href": "https://drive.google.com/drive/folders/1yZyznNDrLM7fLGTdJ54fayNt5GbRMHjM"
        },
        "SVG"
      ],
      " do logotipo do layers para download. Nesses arquivos a é utilizada fonte Nunito."
    ],
    " ",
    [
      "h2",
      {
        "id": "logar-com-layers-e-op-es-de-terceiros"
      },
      " ",
      [
        "a",
        {
          "href": "#logar-com-layers-e-op-es-de-terceiros"
        },
        "Logar com Layers e opções de terceiros"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "O botão de logar com layers deve ser exibido com um destaque pelo menos igual ao de outras opçcões de login de terceiros disponíveis. Por exmeplo, os botões devem ter tamanho e peso visual semelhantes."
    ],
    " ",
    [
      "h2",
      {
        "id": "como-combinar-com-o-estilo-do-seu-app"
      },
      " ",
      [
        "a",
        {
          "href": "#como-combinar-com-o-estilo-do-seu-app"
        },
        "Como combinar com o estilo do seu app"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Recomendamos o uso do botão padrão de login com Layers já que isso permite que os usuários identifiquem a opção mais rapidamente quando a vêem na tela de login. No entanto, se necessário é possível adaptar o botão para que ele combine com o design da sua aplicação ou traduzir o texto \"logar com Layers\" para outros idiomas seguindo as diretrizes nesse guia."
    ],
    " ",
    [
      "h2",
      {
        "id": "tamanho"
      },
      " ",
      [
        "a",
        {
          "href": "#tamanho"
        },
        "Tamanho"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Você pode dimensionar o botào de entrar com Layers de acordo com a necessidade de mostrá-lo em diversos dispositivos de tela, mas é importante que seja preservada a proporção para que o logo do Layers não fique distorcido (esticado ou achatado). Não se esqueça de desenvolver seu botão de Login para que seja o mais rápido e fácil de ser encontrado e clicado possível."
    ],
    " ",
    [
      "h2",
      {
        "id": "texto"
      },
      " ",
      [
        "a",
        {
          "href": "#texto"
        },
        "Texto"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Recomendamos o uso dos textos \"Entrar com o Layers\" ou \"Fazer login com o Layers\" para incentivar que o usuário clique no botão. É preciso que fique claro para o usuário que ele está se inscrevendo no seu app com as suas credenciais do Layers, não criando uma conta do Layers no seu app."
    ],
    " ",
    [
      "h2",
      {
        "id": "espa-amento-m-nimo-e-centraliza-o"
      },
      " ",
      [
        "a",
        {
          "href": "#espa-amento-m-nimo-e-centraliza-o"
        },
        "Espaçamento mínimo e centralização"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Lembre-se sempre de deixar 16px de padding vertical entre os limites do botão e 10px de padding horizontal. Deixe também 16px de espaçamento entre o logo do Layers e o texto. É importante lembrar também que se o botão puder crescer horizontalmente o logo do Layers e o texto devem ficar centralizados."
    ],
    " ",
    [
      "h2",
      {
        "id": "cores-e-estilo"
      },
      " ",
      [
        "a",
        {
          "href": "#cores-e-estilo"
        },
        "Cores e estilo"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "A cor é uma das melhores maneiras de reconhecer algo rápidamente, por isso recomendamos o uso de identidade do Layers. Quand o fundo for branco, a cor do um botão deve ser verde (#00B8AD) quando não pressionado e o logo do Layers deve ser branco. Para o restante dos casos, o botão deve ser claro (#FFFFFF) e o simbolo do Layers deve ser verde (#008BAD). O botão branco pode ser utilizado também quando o fundo for branco desde que tenha drop shaddow ou outline para indicar seus limites."
    ],
    " ",
    [
      "p",
      null,
      [
        "img",
        {
          "src": "/docs/assets/img/oauth/entrar_verde.png",
          "alt": "botao-verde"
        }
      ],
      " ",
      [
        "img",
        {
          "src": "/docs/assets/img/oauth/entrar_branco.png",
          "alt": "botao-branco"
        }
      ],
      " ",
      [
        "img",
        {
          "src": "/docs/assets/img/oauth/entrar_shaddow.png",
          "alt": "botao-shaddow"
        }
      ]
    ],
    " ",
    [
      "h2",
      {
        "id": "fonte"
      },
      " ",
      [
        "a",
        {
          "href": "#fonte"
        },
        "Fonte"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Recomendamos o uso da fonte ",
      [
        "a",
        {
          "href": "https://fonts.google.com/specimen/Nunito"
        },
        "Nunito Bold"
      ],
      ". Para instalar, procure pela fonte Nunito no Google Fonts. Utilize outras fontes no botão apenas se for necessário para que ele combine com o estilo de sua aplicação. Para sites que usam o botão de login personalizado, é possível carregar a fonte Nunito diretamente do Google Fonts."
    ],
    " ",
    [
      "h2",
      {
        "id": "design-incorreto"
      },
      " ",
      [
        "a",
        {
          "href": "#design-incorreto"
        },
        "Design incorreto"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Para manter a identidade e o reconhecimento da marca Layers ao fazer login, alguns casos não são permitidos:"
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        "Não distorça, estique ou achate o simbolo do Layers dentro do botão."
      ],
      " ",
      [
        "li",
        null,
        "Não aplique o logo verde do Layers sobre cores."
      ],
      " ",
      [
        "li",
        null,
        "Não utilize o simbolo do logo do Layers sozinho no botão."
      ],
      " ",
      [
        "li",
        null,
        "Não utilize drop shaddows muito fortes."
      ],
      " ",
      [
        "li",
        null,
        "Não mude a cor do logo do Layers "
      ],
      " ",
      [
        "li",
        null,
        "Não use o ícone ou logotipo do Layers sozinho, sem o contorno ou sem ou texto que indique a ação do usuário"
      ],
      " "
    ]
  ],
  "title": "Melhores práticas de login com o Layers Education",
  "headings": [
    {
      "text": "Logar com Layers e opções de terceiros",
      "href": "#logar-com-layers-e-op-es-de-terceiros"
    },
    {
      "text": "Como combinar com o estilo do seu app",
      "href": "#como-combinar-com-o-estilo-do-seu-app"
    },
    {
      "text": "Tamanho",
      "href": "#tamanho"
    },
    {
      "text": "Texto",
      "href": "#texto"
    },
    {
      "text": "Espaçamento mínimo e centralização",
      "href": "#espa-amento-m-nimo-e-centraliza-o"
    },
    {
      "text": "Cores e estilo",
      "href": "#cores-e-estilo"
    },
    {
      "text": "Fonte",
      "href": "#fonte"
    },
    {
      "text": "Design incorreto",
      "href": "#design-incorreto"
    }
  ],
  "pageClass": "page-guides-oauth-melhores-praticas"
}
