{
  "path": "/docs/concepts/funcionalidades/hub-de-apis",
  "template": "default",
  "title": "Hub de APIs",
  "tableOfContents": true,
  "body": [
    "div",
    null,
    [
      "p",
      {
        "class": "intro"
      },
      "Apps no Layers podem prover e/ou requisitar informações através do Hub de APIs por meio de actions: protocolos que especificam o formato de requisições e respostas que devem ser seguidos tanto pelo app que requisita as informações quanto pelo app que vai provê-las."
    ],
    " ",
    [
      "h2",
      {
        "id": "fluxo-de-informa-es"
      },
      " ",
      [
        "a",
        {
          "href": "#fluxo-de-informa-es"
        },
        "Fluxo de Informações"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "A troca de informações entre apps por meio do Hub de APIs pode ser descrita em quatro etapas:"
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        [
          "strong",
          null,
          " 1 - App requisita informações "
        ]
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "A troca de informações entre apps do Layers começa com o app que necessita de informações fazendo uma requisição ",
      [
        "code",
        null,
        "POST"
      ],
      " para o Layers seguindo o padrão estabelecido pela action especificada como parâmetro na URL."
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        [
          "strong",
          null,
          " 2 - Layers repassa a requisição "
        ]
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Uma vez que o Layers recebe a requisição, o corpo é válidado de acordo com o protocolo da action. Se o formato da requisição estiver de acordo com o formato especificado o Layers repassa a requisição para o provedor especificado como parâmetro na URL adicionando informações de contexto da requisição."
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        [
          "strong",
          null,
          " 3 - App responde a requisição "
        ]
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "O app provedor registrado recebe então a requisição vinda do Layers na URL especificada quando ele foi cadastrado como provedor para a action que foi requisitada. A resposta deve seguir o formato especificado pelo protocolo da action."
    ],
    " ",
    [
      "ul",
      null,
      " ",
      [
        "li",
        null,
        [
          "strong",
          null,
          " 4 - Layers repassa a resposta "
        ]
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "Ao receber a resposta do provedor, o Layers verifica se ela está de acordo com o protocolo da action e repassa as informações recebidas para o app que as requisitou."
    ],
    " ",
    [
      "h2",
      {
        "id": "actions-dispon-veis"
      },
      " ",
      [
        "a",
        {
          "href": "#actions-dispon-veis"
        },
        "Actions disponíveis"
      ],
      " "
    ],
    " ",
    [
      "p",
      null,
      "A ",
      [
        "a",
        {
          "href": "./../../api/apihub/@layerscalendargetrelated/post"
        },
        "referência do Hub de APIs"
      ],
      " tem descritas todas as actions suportadas hoje pela Layers descrevendo o formato de requisição que apps provedores devem receber e qual deve ser o formato da resposta devem retornar."
    ],
    " ",
    [
      "p",
      null,
      "Para cada uma dessas actions, está disponível um app desenvolvido pela Layers que disponibiliza essas informações. Assim, apps provedores podem se responsabilizar apenas em disponibilizar as informações e nossos apps se responsabilizam por expôr essas informações da melhor maneira para os usuários da Layers."
    ],
    " ",
    ""
  ],
  "headings": [
    {
      "text": "Fluxo de Informações",
      "href": "#fluxo-de-informa-es"
    },
    {
      "text": "Actions disponíveis",
      "href": "#actions-dispon-veis"
    }
  ],
  "pageClass": "page-concepts-funcionalidades-hub-de-apis"
}
